Ran Plan for project: `dev-my-bucket` dir: `components/terraform/s3-bucket` workspace: `dev`

<details><summary>Show Output</summary>

```diff
WARN  XDG cache dir unavailable, falling back to manual construction error="failed to create directory /.cache/atmos/toolchain: mkdir /.cache: permission denied"
**Notice:** Telemetry Enabled - Atmos now collects anonymous telemetry regarding usage. This information is used to shape the Atmos roadmap and prioritize features. You can learn more, including how to opt out if you'd prefer not to participate in this anonymous program, by visiting: https://atmos.tools/cli/telemetry
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v6.27.0

Terraform has been successfully initialized!
Switched to workspace "dev-my-bucket".

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-bucket-atmos-updated"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "development"
          + "ManagedBy"   = "Atmos"
          + "Stage"       = "dev"
          + "Team"        = "Platform"
        }
      + tags_all                    = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "development"
          + "ManagedBy"   = "Atmos"
          + "Stage"       = "dev"
          + "Team"        = "Platform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev-my-bucket
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://localhost:4141/lock?id=rahul-infra%252Fatlantis-terraform-demo%252Fcomponents%252Fterraform%252Fs3-bucket%252Fdev)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev-my-bucket
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```